In [2]:
import numpy as np
import pandas as pd

In [4]:
d = { 
    "A" : [1, 2, np.nan],
    "B" : [5, np.nan, np.nan],
    "C" : [1, 2, 3]
}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [5]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
# drop all rows with nan values
df.dropna()

     A    B  C
0  1.0  5.0  1

In [9]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [11]:
# drop nan rows where nan is more than twice
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [12]:
# fill nan values with 0
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [13]:
# fill with mean
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64